
// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
//
// let time = prompt('Введіть ціле число від 0 до 59');
//
// if (time >= 0 && time < 15) {
//     alert('Перша чверть')
// } else if (time >= 15 && time < 30) {
//     alert('Друга чверть')
// } else if (time >= 30 && time < 45) {
//     alert('Третя чверть')
// } else if (time >= 45 && time <= 59) {
//     alert('Четверта чверть')
// }

//
// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
// //
// let day = prompt('Введіть число місяця (1-31)')
// if (day >= 1 && day <= 10) {
//     console.log('First')
// } else if (day >= 11 && day <= 20) {
//     console.log('Second')
// } else if (day >= 21 && day <= 30) {
//     console.log('Third')
// } else if (day <= 31){
//     console.log('Fourth')
// } else {
//     alert('Нема такої дати)')
// }

// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
// let test;
// if (confirm('Вірно or Неправильно')) {
//     test = 'Вірно'
// } else {
//     test = 'Неправильно'
// }
// console.log(test)

//  let test = confirm('Вірно or Неправильно') ? 'Вірно' : 'Неправильно'
// console.log(test)
//
// let test = confirm('true?')
// if (!!!test) {
//     test = 'false'
//     }
// console.log(test)
//
// /
// //
// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
//

// let a = +prompt('vvedit chyslo 1, 0, -3')
// if (a!==0) {
// console.log('virno')
// } else {
//     console.log('nevirno')
// }


// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.
//
// let timetable = prompt('Введіть порядковий номер дня тижня');
// switch (timetable){
//     case '1':
//         console.log('Робота, навчання');
//         break
//     case '2':
//         console.log('Робота, виконання дзшки)')
//         break
//     case '3':
//         console.log('Маленька пятниця (сорі за пятницю, не знаю, як ставиться апостроф)')
//         break
//     case '4':
//         console.log('Піти в кіно')
//         break
//     case '5':
//         console.log('Скорочений день)')
//         break
//     case '6':
//         console.log('Англійська')
//         break
//     case '7':
//         console.log('Зустрітись з друзями')
//         break
//     case '8':
//         console.log('Нема такого дня в тижні, хоча здався би)')
//         break
//     default:
//         console.log('І такого дня теж не існує)')
//         break
// }



// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
// let year = 2020;
// if (year%4 ===0){
//     console.log('yes')
// } else {
//     console.log('no')
// }
//
// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!


// let xxx = prompt('Яка «офіційна» назва JavaScript?')
// if (xxx ==='ECMAScript') {
//     alert('Правильно!')
// } else {
//     alert('Не знаєте? ECMAScript!')
// }

