// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
//     1. перебрати його циклом while
// let j = [2,17,13,6,22,31,45,66,100,-18];
// i = 0
// while (i < j.length){
//     console.log(j[i])
//     i++
// }
// перебрати його циклом for
// let j = [2,17,13,6,22,31,45,66,100,-18];
// for (let i = 0; i < j.length; i++) {
//   console.log(j[i])
// }
// перебрати циклом while та вивести  числа тільки з непарним індексом
// let j = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// i = 0;
// while (i < j.length){
//     if (i % 2 !== 0) {
//         console.log(j[i])
//     }
// i++
// }
// перебрати циклом for та вивести  числа тільки з непарним індексом
// let j = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// i = 0
// for (let i = 0; i < j.length; i++) {
//     if (i % 2 !== 0)
//         console.log(j[i]);
// }
// перебрати циклом while та вивести  числа тільки парні  значення

// let j = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// i = 0;
// while (i < j.length) {
//     if (i % 2 === 0) {
//         console.log(j[i])
//     }
//     i++
// }
// перебрати циклом for та вивести  числа тільки парні  значення
// let j = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
// for (let i = 0; i < j.length; i++) {
//     if (i%2 ===0){
//         console.log(j[i])
//     }
//
// }
// замінити кожне число кратне 3 на слово "okten"
// let j = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// for (let i = 0; i < j.length; i++) {
//     if (j[i] % 3 === 0) {
//         j[i] = "okten"
//         console.log(j[i])
//     }
// }
// console.log(j)

// вивести масив в зворотньому порядку.
// let j = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// for (let i = j.length - 1; i >= 0; i--) {
//     console.log(j[i]) ;
//
// }
