// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.
// let a = +prompt('first');
// let b = +prompt('second');
// if (a > b) {
//     console.log(a)
// } else if (a < b) {
//     console.log(b)
// } else if (a = b) {
//     console.log('a=b')
// }

// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
// let number = +prompt('Номер квартири')
// if (number >= 1 && number <= 20) {
//     console.log('first')
// } else if (number >=21 && number<=48){
//     console.log('second')
// } else if (number>= 49 && number<=90){
//     console.log('third')
// } else {
//     console.log('Немає такої квартири')
// }

// - Ми маємо змінну number в яку користувач задає числове значення,
//     якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
//
// let number = +prompt('Введіть число')
// if (number === 10) {
//     alert('ВІРНО')
// } else {
//     alert('НЕВІРНО')
// }

// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else

// let x;
// if (typeof x === "number"){
//     console.log(1)
// } else if (typeof x ==="string"){
//     console.log(2)
// }else if (typeof x === "boolean"){
//     console.log(3)
// } else if (typeof x === {} || []){
//     console.log(4)
// } else {
//     console.log('else')
// }

// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо
// ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
let t = +prompt('Шо там по погоді?)') t >=10 && t <=22 ? alert('гоу на навчання') : alert('сидимо вдома')

// (+prompt('Введіть число') === 10) ? console.log('ВІРНО') :  console.log('НЕ ВІРНО')